{"pages":[{"title":"","text":"这里是Melantha的小窝！坐标湖北武汉 一只徘徊在退役边缘的可怜高二蒟蒻$$QQ:1826544539$$ （可以加来嘲讽一下）","link":"/about/index.html"}],"posts":[{"title":"2019清北学堂·游记","text":"被巨巨们被虐到自闭的八天 Day 1​ 一早上就考了一场试，T1刚开始以为是线段树，后来嫌麻烦用Deque做了，考场预计得分80左右。T2看到数据范围以后的确想到了正解状压DP，但是因为没有办法解决加入时间以后变成三维DP会空间不够的问题，最后还是用了dfs来解，觉得18的点完全没有办法卡过去啊，本来准备打n=1的情况下的DP的也没时间了。T3的话完全没有细看，暴力完全没有时间敲，最后还是不了了之。 ​ 预计得分：80+60+0=140 ​ 实际得分：100+0+0=100 ​ 看到成绩的时候吓了一大跳，因为完全没有想到T2会爆零，去检查了上交的程序才发现交成了有问题的，样例都没有过，全部出了零，真·爆零（笑）。T1竟然是正解，看好多人都只拿了90，也幸亏T1稍微稳了一点才没有太丢人。T3好像没人做出来的样子，但是有几个人输出0竟然拿了5分。这次考试时间的分配有很大问题，T1题目读反了导致我白打了一个线段树，在发现我手模结果和样例输出不一样才反应过来，以后做题要先理解样例再敲程序了。花费太多时间在T1上也导致了我其他题都稍微有些仓促，可以说这次考试中我很多值得可惜的地方了。 ​ 中午随便吃了点什么，去了ptb昨天晚上去的小饭店，味道异常的不错，但是他竟然把鸭肠看成了牛肚…… ​ 下午开始讲题，T1这样做就可以了，大家出错也大多是什么没有清空之类的小问题，没有什么区分度。T2其实已经尽力了，只能说对于DP的理解还很不到位吧，原来最终得到的价值可以直接通过状压算出来，所以大可不必存下价值，而可以把时间放进数组里面去，这样就是二维了。还有一个小优化就是第二维”位置”只可能是状压中已经为1的点（因为0的点还没走到过怎么可能是当前的），所以只需要枚举为1的就行了，这样DP的空间复杂度就到了可以接受的范围。T3概率题实际上还是没有弄的很懂，回房间再琢磨一下…… ​ 查了一些发现老师竟然是十二省联考“皮配”的出题人，怪不得这么钟爱DP，课后给我们拓展对的题目也有好多DP题。有一道“子矩阵”特别喜欢，状态转移方程是：设f[i][j]表示在这个r*m的矩阵中，在其前i列中选择j列（且选的列中包括第i列），组成的子矩阵中，最小值（即其相邻元素的差的绝对值的和的最小值）是多少。具体是：$$f[i][j]=min(f[k][j-1]+sum[i]+c[i][k])$$sum是这一行所有元素的值，c则是i和k两行的差的绝对值，可以说是很玄妙了，很喜欢这道题。 ​ 还有就是一些 骚方法/思路 了，包括但不限于对顶堆，斯特林公式，和已经知道的哈弗曼树，觉的都是很有用的小方法qaq 2019.10.01 22:33于巨化宾馆 Day 2​ 首先祝贺lyq大佬成功取得rk1！！ ​ 今天的考试总体上还算不错，但还是有一些遗憾在里面。今天的T3把能行和不能行的状态输出反了导致平均30+的题我一分没有得。T1和T2做起来都还算得心应手，基本上在一个小时以内把自己的思路基本实现了，需要修改的手残的地方相对以前少了很多，以此节省了很多时间。然而对剩下的时间的运用仍然不是很恰当，因为前两题做的速度太快，我心里并不是完全相信他们的正确性，于是在考试进行一个小时多（九点多）的时候开始了对拍，拍了一个小时才让自己安心，然而并没有发现自己的程序的大问题，到是发现T2的INF开小了，也不算完全没有收获。但是因此浪费了很多思考T3的时间，导致暴力敲的略赶，出现了爆零的情况。 ​ 分析一下我自己的程序，T1思路没有问题。T2算错了复杂度，最优性剪枝在构造的大数据面前特别无力，本来自以为是O（nlogn）被最后几个构造数据卡成了O（猴），但是意外的在随机数据下表现优秀。T3非常傻逼的把可行和不可行的输出打反了，平均30+的题目我爆零了，rk1→rk5 ​ T2的正解是两个前缀和+双指针（尺取法）+链表，主要在于一个关于前缀和的如何求出区间合并最小费用的结论（在一个由L到R的区间内，把这些点聚集到mid时才是最优的），（然而我只想到了最无关紧要的链表qaq）。T3一如既往的难，主要思路是二分图匹配，要分成两个subtask来写。 ​ 晚上据说要讲数据结构，然而只讲了树状数组。第一次知道了还有这么多用法，要好好巩固一下。前几道题（像【NOIP2010】关押罪犯、【Apio2008】免费道路）我基本都做过，但是有一道bzoj的“跳跳棋”我还是没有很懂，需要再继续琢磨。树状数组的几道题到是都很有新意，都是很巧妙的方法。如抛弃了传统树链剖分方法的“上帝造题的7分钟2/花神游历各国”就是一个很好的例子。 ​ 生活方面，有是口腔溃疡的痛苦的一天，这几天饭都没有吃好，希望明天早上能好起来（笑） ​ 2019.10.02 于巨化宾馆","link":"/2019/10/01/2019清北学堂·游记/"},{"title":"Hello World!","text":"欢迎来到Melantha的小世界！ 现在是2019年8月27日17点50分，喜大普奔，博客终于搭成啦！！！ Thank List 先感谢那些助我完成这个工程的dalao们 首先是zgjjj神仙！ 可以说，这个博客的大部分内容都是ta手把手教出来的 还有pzhpzh和kanekik两位大佬也帮了好多的忙 除此之外，还有好多好多人的陪伴和鼓励 真的好感谢ta们 Word to Say 第一篇博文本来还没有想好写什么，就索性随便写一点吧。（权当实验maerkdown） 这个博客从暑假之前就有设想了，在南京游学期间也不是没有尝试过（第三天我搞到了三点），最终因为各种各样的问题放弃了。还好之前认识的几位dalao的帮忙，在鸽了两个月以后的今天我终于能给我的博客之路一个还算挺不错的开始 在这两个月中间发生了什么呢？ 出了一道题、参与了一次比赛的策划、（被迫）了解了vbs小脚本的威力…… 许许多多鸡毛蒜皮的小事构成了我这两个月的暑假生活，收获也算很多叭。 几天以后就是开学了，希望不要延续上个学期期末的文化竞赛两开花（笑 Wish to the Future 说不希望参加noi当然是假的。 但是说实话，现在的我对于这个目标还有着很大的差距，尤其是在CCF修改了竞赛规则的2019年。也许这个博客出现的稍微晚了一些，也许这个博客很快就会停更，但我还是希望能够把这个博客做到我力所能及的最好，也希望能够尽量晚一些退役 但谁又不是呢 2019-8-27 20:10:09 于WGSZ机房","link":"/2019/08/27/hello-world/"},{"title":"更新日志","text":"用来记录这个博客的更新/美化/修锅历程喵！ To Do List博客本身 增加对LaTeX的支持！ 一只可爱的看板娘！ 增加“标签”功能！ （重要）日死ZYH 博文内容 没了 2019-8-27建立博客 完成用户名/头像的 “基本设置” 2019-8-28完成网页小标识 “favicon” 完成左上及右下角的禹卫书法隶书简体 “logo” 试图添加一只可爱的看板娘失败（甚至局面一度不可收拾 2019-9-9增加点击特效：“ ♥ “ 完成”About“页面","link":"/2019/08/27/更新日志/"}],"tags":[{"name":"想去的城","slug":"想去的城","link":"/tags/想去的城/"},{"name":"想说的话","slug":"想说的话","link":"/tags/想说的话/"},{"name":"想做的事","slug":"想做的事","link":"/tags/想做的事/"}],"categories":[]}